name: "arcface"
platform: "onnxruntime_onnx"
default_model_filename: "backbone_r18.onnx"
max_batch_size: 16
input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [3, 112, 112]
  }
]
output [
  {
    name: "embedding"
    data_type: TYPE_FP32
    dims: [512]
  }
]
instance_group [
  {
    kind: KIND_CPU
    count: 1
  }
]
dynamic_batching {
  preferred_batch_size: [4, 8, 16]
  max_queue_delay_microseconds: 1000
}
