name: "lightqnet"
platform: "onnxruntime_onnx"
default_model_filename: "lightqnet-dm100.onnx"
max_batch_size: 16
input [
  {
    name: "input:0"
    data_type: TYPE_FP32
    dims: [96, 96, 3]
  }
]
output [
  {
    name: "confidence_st:0"
    data_type: TYPE_FP32
    dims: [1]
  }
]
instance_group [
  {
    kind: KIND_CPU
    count: 1
  }
]
dynamic_batching {
  preferred_batch_size: [4, 8, 16]
  max_queue_delay_microseconds: 1000
}
